TaskName = "Digital Fax Archive";

//progress bar string when reading/writing the information from the device
"TEST_PROGRESS_TITLE" = "Testing is in progress… Please wait.";
"DEVICE_COMMUNICATION_SETTINGS" = "Writing the settings to the device… Please wait";
"DEVICE_COMMUNICATION_HOST" = "Writing the host name to the device… Please wait";

//Titles of Buttons
"AUTO_TEXT" = "Auto";
"OK" = "OK";
"HOST_TITLE" = "Currently receiving faxes: %@";
"SELECT_FOLDER" = "Choose Folder…";
"SELECT_EMAIL" = "Email Settings…";
"FOLDER_SELECTION_BUTTON_TITLE" = "Select";
"FOLDER_SELECTION_PANEL_TITLE" = "Select a Folder";

/* Error strings*/

"GENERAL_DATA_MISSING_DESCRIPTION" = "One or more fields do not contain any data. Please complete all fields or click Cancel.";
"GENERAL_DATA_MISSING_TITLE" = "Missing or Invalid Data Error";
"MISSING_FOLDER_SETTING" = "Some folder destination details are missing. Please select a folder, enter user name and password, then try again.";

"SUCCESS" = "Success";
"FOLDER_SETTINGS_SUCCESS" = "You’ve successfully set up HP Digital Fax. Your incoming black-and-white faxes will now be saved to the \"%@\" folder.";
"EMAIL_SETTINGS_SUCCESS" = "You’ve successfully set up HP Digital Fax. Your incoming black-and-white faxes will now be sent to \"%@\" as e-mail attachments.";


"AFP Authentication" = "AFP Server Authentication";
"SMB Authentication" = "SMB/CIFS File System Authentication";

"ENTER_SERVER_DETAILS_ERROR_TITLE" = "Enter Server Details";
"ENTER_SERVER_DETAILS_ERROR_DESC" = "Please enter all the server details.";

/* Error string when connecting */
HSDFolderWithPercentSignTitleFormat = "The folder '%@' can’t be used";
HSDFolderWithPercentSignDescription = "Use folder name with no percent sign.";

"CONNECTION_FAILED_TITLE" = "Connection failed";
"CONNECTION_FAILED_DESC" = "The server may not exist or it is not operational at this time. Check the server name or IP address and try again.";

"AUTH_FAILED_TITLE" = "Authentication failed";
"AUTH_FAILED_DESC" = "Unknown user, incorrect password, or login is disabled. Please retype the name and password or contact the server's administrator.";

"UNHANDLED_ERROR_TITLE" = "Unexpected Error";
"UNHANDLED_ERROR_DESC" = "An error %d occurred when trying to connect to the server.";

HSDServerParametersErrorTitle = "Incomplete server information";
HSDServerParametersErrorDescription = "Server information fields cannot be empty. Enter all required server details, and then try again.";

HSDUnableToSelectFolderTitle = "Cannot use the selected folder";
HSDPermissionsErrorDescription = "You don’t have permission to write to the selected folder. Select another folder, and then try again.";
"MISSING_SERVER_CREDENTIALS" = "The server credentials are missing. Please enter user name and password, then try again.";

HSDProtocolErrorDescription = "The selected folder cannot be found on the specified server or connection to the server is established via different file sharing protocol.";

//Progress title when printing the list
"PRINT_PROGRESS_TITLE" = "Printing… Please wait";

//progress title while initializing the print
"PRINT_INITIALIZING_TITLE" = "Processing…";


//Max limit for fax blocking list reached error
"BLOCK_FAX_ERROR_TITLE" = "Blocked Numbers Limit Reached";
"BLOCK_FAX_ERROR_DESC" = "Your device can store a maximum of %d blocked Fax numbers. Unblock some Fax numbers and then try again.";

//Fax log results
"ERROR" = "Error";
"BUSY" = "Busy";
"NO_ANSWER" = "No Answer";
"NO_DIAL_TONE" = "No Dial Tone";
"NO_DOCUMENT" = "No Document";
"DOCUMENT_JAM" = "Document Jam";
"DOOR_OPEN" = "Door Open";
"POWER_FAILURE" = "Power Failure";
"BLACKLISTED" = "Blacklisted";
"STORAGE_FULL" = "Storage Full";
"OUT_OF_MEMORY" = "Out of Memory";
"PHONE_LINE_UNAVAILABLE" = "Phone Line Unavailable";
"FAX_DISCONNECTED" = "Fax Disconnected";
"PC_DISCONNECTED" = "Computer Disconnected";
"REMOTE_NOT_COLOR" = "Remote Not Color";
"COMMUNICATION_ERROR" = "Communication Error";
"CANCELLED" = "Cancelled";

//Fax session types
"SENT" = "Sent";
"RECEIVED" = "Received";
